#+TITLE: Emacs Configuration

My emacs configuration. I expect this to grow over time and it is very much a work in progress. Many of the ideas from this are taken shameless from  Harry Schwartz's configuration which can be found [[https://github.com/hrs/dotfiles][at this github dotfiles.]]

** Task Management
 #+BEGIN_SRC emacs-lisp

 (setq org-directory "~/Dropbox/org")

 (defun org-file-path (filename)
   "Return the absolute address of an org file, given its relative name."
   (concat (file-name-as-directory org-directory) filename))

 (setq org-index-file (org-file-path "index.org"))
 (setq org-scrapbook-file (org-file-path "scrapbook.org"))

 (setq org-archive-location
       (concat (org-file-path "archive.org") "::* From %s"))
 #+END_SRC

 #+RESULTS:
 : ~/Dropbox/org/archive.org::* From %s


 I store all my todos in =~/org/index.org=, so I'd like to derive my agenda from
 there.

 #+BEGIN_SRC emacs-lisp
   (setq org-agenda-files (list org-index-file))
 #+END_SRC

 Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
 place in the archive.

 #+BEGIN_SRC emacs-lisp
   (defun mark-done-and-archive ()
     "Mark the state of an org-mode item as DONE and archive it."
     (interactive)
     (org-todo 'done)
     (org-archive-subtree))

   (define-key global-map "\C-c\C-x\C-s" 'mark-done-and-archive)
 #+END_SRC

 Record the time that a todo was archived.

 #+BEGIN_SRC emacs-lisp
   (setq org-log-done 'time)
 #+END_SRC

